In [1]:
import pandas as pd

In [92]:
df1 = pd.read_csv('zippedData/imdb.title.basics.csv.gz')
df2 = pd.read_csv('zippedData/imdb.name.basics.csv.gz') # match people's info with codes
df3 = pd.read_csv('zippedData/imdb.title.akas.csv.gz')
# df4 = pd.read_csv('zippedData/imdb.title.crew.csv.gz') # director and writer codes
df5 = pd.read_csv('zippedData/imdb.title.principals.csv.gz')
df6 = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')
df7 = pd.read_csv('zippedData/bom.movie_gross.csv.gz')
df8 = pd.read_csv('zippedData/rt.movie_info.tsv.gz')
df9 = pd.read_csv('zippedData/rt.reviews.tsv.gz')
df10 = pd.read_csv('zippedData/tmdb.movies.csv.gz')
df11 = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

ParserError: Error tokenizing data. C error: Expected 3 fields in line 5, saw 5

In [90]:
print('df1')
df1.info()
print('df2')
df2.info()
print('df3')
df3.info()
# print('df4')
# df4.info()
print('df5')
df5.info()
print('df6')
df6.info()
print('df7')
df7.info()
print('df8')
df8.info()
print('df9')
df9.info()
print('df10')
df10.info()
print('df11')
df11.info()

df1
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB
df2
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB
df3
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB
df5
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB
df6
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB
df7
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB
df8

NameError: name 'df8' is not defined

In [19]:
df6.describe()

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [67]:
df6.quantile(.9)

averagerating       8.1
numvotes         1587.5
Name: 0.9, dtype: float64

In [68]:
rating = df6.sort_values(by=['averagerating'], ascending=False).loc[df6['numvotes'] > 282].set_index('tconst')
rating
# movies with more than 1000 ratings, sorted by highest rating.
# contains no null values!
# correlation between num votes and revenue?

           averagerating  numvotes
tconst
tt9537008            9.9       417
tt8718580            9.7       639
tt7131622            9.7      5600
tt9760512            9.6       427
tt9680166            9.6       624
...                  ...       ...
tt4937514            1.0       388
tt3216288            1.0       440
tt2100624            1.0       429
tt3855260            1.0       520
tt1976600            1.0       436

[18445 rows x 2 columns]

In [81]:
actors = df5.loc[df5['ordering'] == 1].set_index('nconst').drop(columns=['job', 'ordering'])
actors

               tconst category            characters
nconst
nm0246005   tt0111414    actor           ["The Man"]
nm3579312   tt0323808  actress      ["Beth Boothby"]
nm0532721   tt0417610    actor             ["Lucio"]
nm0036109   tt0469152  actress    ["Eleanor Jordan"]
nm2093546   tt0473032    actor     ["Uncle Nimlash"]
...               ...      ...                   ...
nm3868049   tt9678962    actor           ["Maarten"]
nm9742452   tt9679036  actress    ["Yuna Takahashi"]
nm7681636   tt9681728    actor           ["Nazarka"]
nm10439726  tt9689618    actor                   NaN
nm0186469   tt9692684    actor  ["Ebenezer Scrooge"]

[143454 rows x 3 columns]

In [88]:
# j1 = rating.join(actors, how='left')
# j1

actors.join(title, how='left').set_index('tconst').join(rating, how='right') \
.drop(columns=['primary_profession', 'known_for_titles', 'death_year', 'birth_year']) \

,category,characters,primary_name,averagerating,numvotes
tconst,,,,,
tt9537008,actress,NaN,Githanjali,9.9,417
tt8718580,actor,NaN,Shanthi Anand,9.7,639
tt7131622,actor,"[""Rick Dalton""]",Leonardo DiCaprio,9.7,5600
tt9760512,actor,NaN,Suraj Gowda,9.6,427
tt9680166,actor,NaN,Preetyka Chauhan,9.6,624
...,...,...,...,...,...
tt4937514,actress,NaN,Suzuna Kinosuta,1.0,388
tt3216288,actor,NaN,Yukihiko Kageyama,1.0,440
tt2100624,actress,NaN,Miho Arai,1.0,429
tt3855260,actor,"[""Haneda""]",Kôta Fudauchi,1.0,520
tt1976600,actor,"[""Father""]",Jonathan Chang,1.0,436

In [83]:
title = df2.set_index('nconst')
title

,primary_name,birth_year,death_year,primary_profession,known_for_titles
nconst,,,,,
nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...
nm9990381,Susan Grobes,NaN,NaN,actress,NaN
nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [40]:
df7.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010